order-service/old.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <Action s:mustUnderstand="1" 
            xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ISDMSDK/RegisterCustomer</Action>
    </s:Header>
    <s:Body>
        <RegisterCustomer xmlns="http://tempuri.org/">
            <licenseCode>DEBUG_MODE</licenseCode>
            <requestID>1</requestID>
            <language>en</language>
                <d4p1:CUST_NOTIFICATION_MOBILE>501234567</d4p1:CUST_NOTIFICATION_MOBILE>
                <d4p1:CUST_PHONEAREACODE>50</d4p1:CUST_PHONEAREACODE> [First two digits of the mobile number]
                <d4p1:CUST_PHONECOUNTRYCODE>971</d4p1:CUST_PHONECOUNTRYCODE>
                <d4p1:CUST_PHONELOOKUP>501234567</d4p1:CUST_PHONELOOKUP>[Full mobile number]
                <d4p1:CUST_PHONENUMBER>1234567</d4p1:CUST_PHONENUMBER>[last 7 digits of the mobile number]
        </RegisterCustomer>
    </s:Body>
</s:Envelope>